{
  "backend/main.mo": "Motoko canister managing daily leaderboards, storing up to 100 sorted score entries per date with submit and query methods.",
  "feature_evidence.json": "Feature evidence report documenting a UI color update to NumberMatrixView and associated components and tests.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files including pages, components, and puzzle modules.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes, plus global element styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/achievements/definitions.ts": "Defines achievement metadata including IDs, titles, and descriptions.",
  "frontend/src/achievements/engine.ts": "Evaluates player performance to unlock achievements and persists unlocked IDs.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, sync manager for queued score submissions, and global toasts.",
  "frontend/src/components/AppShell.tsx": "Main layout shell with header navigation, content outlet, and footer branding.",
  "frontend/src/components/Heatmap365.tsx": "Renders a 365‑day activity heatmap with tooltips and status colors for each date.",
  "frontend/src/game/dailyPuzzle.ts": "Generates deterministic daily puzzles based on date seed, difficulty, and puzzle type selection.",
  "frontend/src/game/difficulty.ts": "Stores difficulty level, computes label, and adjusts level based on streaks and hint usage.",
  "frontend/src/game/hints.ts": "Tracks daily hint usage with a limit and provides remaining‑hint querying and recording.",
  "frontend/src/game/puzzles/numberMatrix.ts": "Generates a 4x4 Latin-square‑style puzzle, validates user input, and provides hints by revealing the next empty cell.",
  "frontend/src/game/puzzles/patternMatch.ts": "Builds simple shape or color pattern‑matching puzzles, checks the selected option, and offers direct answer hints.",
  "frontend/src/game/puzzles/registry.ts": "Maps a date-based seed to one of the available puzzle types.",
  "frontend/src/game/puzzles/sequenceSolver.ts": "Creates number-sequence puzzles with missing values, validates answers, and reveals the next blank as a hint.",
  "frontend/src/game/puzzles/types.ts": "Defines shared interfaces for puzzle instances, validation results, and hint structures.",
  "frontend/src/game/renderers/NumberMatrixView.tsx": "Renders the Number Matrix puzzle as an editable grid and handles numeric input updates.",
  "frontend/src/game/renderers/PatternMatchView.tsx": "Displays a pattern sequence with multiple-choice options and tracks the selected answer.",
  "frontend/src/game/renderers/PuzzleRenderer.tsx": "Chooses the correct puzzle view, manages user input, validation, hints, scoring, and reset actions.",
  "frontend/src/game/renderers/SequenceSolverView.tsx": "Shows a numeric sequence with blanks and captures user inputs for missing positions.",
  "frontend/src/game/scoring.ts": "Calculates final puzzle scores based on hints used and optional timed-mode bonuses.",
  "frontend/src/game/sharing.ts": "Encodes and decodes shareable puzzle payloads using base64 JSON.",
  "frontend/src/game/streaks.ts": "Computes daily play streaks by comparing completion dates to today and prior days.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useLocalGameState.ts": "Manages local game state such as daily progress, streaks, settings, hints, achievements, and heatmap data with associated update helpers.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window event listeners.",
  "frontend/src/hooks/useQueries.ts": "Defines a leaderboard fetch hook using react-query and an actor to load leaderboard data remotely.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light/dark themes and UI styling.",
  "frontend/src/leaderboard/queries.ts": "Provides an online-aware leaderboard query that falls back to cached IndexedDB data when offline or on fetch failure.",
  "frontend/src/lib/dateSeed.ts": "Generates date keys, converts them to numeric seeds, and computes the past 365 days for game logic.",
  "frontend/src/lib/prng.ts": "Implements a seeded PRNG with methods for generating numbers and shuffling arrays.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AchievementsPage.tsx": "Displays a list of achievements and their unlocked status using UI components.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing today's puzzle status, current streak, and a 365‑day activity heatmap.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows the daily leaderboard with online/offline handling and optional identity-based sign‑in for score submission.",
  "frontend/src/pages/PuzzlePage.tsx": "Renders the daily or shared puzzle, manages progress, completion, timed mode, and share-link generation with dialogs and navigation.",
  "frontend/src/pages/SettingsPage.tsx": "Displays account, gameplay, and difficulty settings with Internet Identity login and toggles for timed mode.",
  "frontend/src/storage/db.ts": "Provides localStorage and IndexedDB helpers for async and sync data retrieval and persistence.",
  "frontend/src/storage/models.ts": "Defines TypeScript models for daily records, settings, and queued score submissions.",
  "frontend/src/storage/repo.ts": "Implements CRUD helpers for daily records, settings, achievements, and queued submissions using local storage.",
  "frontend/src/sync/scoreQueue.ts": "Retries submitting queued scores to the backend actor and clears the queue on success.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, plugins, animations, and content scanning paths.",
  "project_state.json": "Stores project metadata, architecture notes, features, and state versioning for Logic Looper."
}