{
  "kind": "build_request",
  "title": "Update Number Matrix grid colors",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Update the Number Matrix puzzle UI colors in frontend/src/game/renderers/NumberMatrixView.tsx so the grid background is blue, prefilled (given) squares are light orange, empty editable squares are a slightly darker orange, and all numbers are black.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also can you change the grid (number matrix) background color to blue and the square's already numbered to light orange, empty boxes which needs input to sightly darker orange and all the numbers be black"
        ]
      },
      "acceptanceCriteria": [
        "When viewing the Number Matrix puzzle, the overall grid area behind/between cells renders with a blue background.",
        "Cells that are prefilled/disabled (data.given[row][col] === true) render with a light orange background.",
        "Cells that are editable (data.given[row][col] === false) render with a slightly darker orange background.",
        "Both prefilled and user-entered digits render in black text.",
        "These color updates apply only to the Number Matrix grid and do not unintentionally change styling of other puzzle types or general app components."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not modify immutable hook/bootstrap paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change Number Matrix puzzle rules, generation, validation, or scoring behavior.",
    "Do not change global theme colors outside the Number Matrix renderer unless required to meet the specified grid colors."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}